Revit 2027 API
EnergyAnalysisDetailModelOptions Constructor
 Constructs default options for energy analysis detailed model creation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EnergyAnalysisDetailModelOptions()
Public Sub New
public:
EnergyAnalysisDetailModelOptions()
new : unit -> EnergyAnalysisDetailModelOptions
See Also
Reference
EnergyAnalysisDetailModelOptions Class
Autodesk.Revit.DB.Analysis Namespace